"""
Задача №15. Иван Васильевич пришел на рынок и решил
купить два арбуза: один для себя, а другой для тещи.
Понятно, что для себя нужно выбрать арбуз
потяжелей, а для тещи полегче. Но вот незадача:
арбузов слишком много и он не знает как же выбрать
самый легкий и самый тяжелый арбуз? Помогите ему!
Пользователь вводит одно число N – количество
арбузов. Вторая строка содержит N чисел,
записанных на новой строчке каждое. Здесь каждое
число – это масса соответствующего арбуза
Input: 5 -> 5 1 6 5 9
Output: 1 9
"""

number = int(input("Введите количество арбузов: "))
min = 10000000
max = 0
for i in range(1, number+1):
    weight = int(input(f"Введите вес арбуза № {i}: "))
    if weight < min:
        min = weight
        iMin = i
    if weight > max:
        max = weight
        iMax = i
print(f"Для себя возьмем арбуз № {iMax} - {max} кг")
print(f"Для тещи возьмем арбуз № {iMin} - {min} кг")