"""
Напишите программу, которая принимает на вход координаты
двух точек и находит расстояние между ними в 2D пространстве.
Пример:
- A (3,6); B (2,1) -> 5,09
- A (7,-5); B (1,-1) -> 7,21
"""

import math
x1 = float(input("Введите значение Х координаты ПЕРВОЙ точки: "))
y1 = float(input("Введите значение Y координаты ПЕРВОЙ точки: "))
x2 = float(input("Введите значение Х координаты ВТОРОЙ точки: "))
y2 = float(input("Введите значение Y координаты ВТОРОЙ точки: "))
distance = math.sqrt((x1-x2)**2 + (y1-y2)**2)
roundDistance = math.trunc(distance * 100)/100
print(f"Расстояние между ПЕРВОЙ точкой ({x1}, {y1}) и ВТОРОЙ точкой ({x2}, {y2}) равняется {roundDistance}")